{
  "section": [
    {
      "id": "129",
      "room_id": 1,
      "color": "#2fd526",
      "title": "QA"
    },
    {
      "id": "135",
      "room_id": 2,
      "color": "#32c8c4",
      "title": "Backend"
    },
    {
      "id": "133",
      "room_id": 3,
      "color": "#ec8e11",
      "title": "Frontend"
    },
    {
      "id": "131",
      "room_id": 4,
      "color": "#61ace1",
      "title": "Design"
    },
    {
      "id": "130",
      "room_id": 1,
      "color": "#3481b8",
      "title": "Backend"
    },
    {
      "id": "132",
      "room_id": 5,
      "color": "#e905ea",
      "title": "Management"
    },
    {
      "id": "134",
      "room_id": 4,
      "color": "#b02ac1",
      "title": "Mobile"
    }
  ],
  "room": [
    {
      "id": 1,
      "title": "Зал 1"
    },
    {
      "id": 2,
      "title": "Зал 2"
    },
    {
      "id": 3,
      "title": "Зал 3"
    },
    {
      "id": 4,
      "title": "Зал 4"
    },
    {
      "id": 5,
      "title": "Зал 2-3"
    }
  ],
  "day": [
    {
      "id": 1,
      "title": "26 марта",
      "date": "2016-03-26"
    },
    {
      "id": 2,
      "title": "27 марта",
      "date": "2016-03-27"
    }
  ],
  "company": [
    {
      "id": "72",
      "title": "2ГИС"
    },
    {
      "id": "134",
      "title": "СКБ Контур"
    },
    {
      "id": "149",
      "title": "Яндекс"
    },
    {
      "id": "150",
      "title": "фрилансер"
    },
    {
      "id": "379",
      "title": "ScrumTrek"
    },
    {
      "id": "384",
      "title": "JetBrains"
    },
    {
      "id": "592",
      "title": "Excelsior"
    },
    {
      "id": "700",
      "title": "Google"
    },
    {
      "id": "962",
      "title": "Badoo Development"
    },
    {
      "id": "1221",
      "title": "Opera Software"
    },
    {
      "id": "1442",
      "title": "Spotify"
    },
    {
      "id": "1446",
      "title": "ГАИШ МГУ"
    },
    {
      "id": "1501",
      "title": "mnogosdelal.ru"
    },
    {
      "id": "1537",
      "title": "Flamp"
    },
    {
      "id": "2142",
      "title": "Mail.Ru"
    },
    {
      "id": "2975",
      "title": "Одноклассники"
    },
    {
      "id": "3507",
      "title": "AppConsulting и AppFollow"
    },
    {
      "id": "3853",
      "title": "Digital Security"
    },
    {
      "id": "3862",
      "title": "Dropbox"
    },
    {
      "id": "3863",
      "title": "Zend Technologies"
    },
    {
      "id": "3864",
      "title": "DataRobot"
    },
    {
      "id": "3865",
      "title": "Злые марсиане"
    },
    {
      "id": "3866",
      "title": "ABL - The Problem Solver"
    },
    {
      "id": "3867",
      "title": "ARM"
    },
    {
      "id": "3868",
      "title": "FOODit"
    },
    {
      "id": "3869",
      "title": "HPE Software"
    },
    {
      "id": "3871",
      "title": "Rambler"
    },
    {
      "id": "3872",
      "title": "Realm Inc"
    },
    {
      "id": "3873",
      "title": "MariaDB foundation"
    },
    {
      "id": "3874",
      "title": "Artsy"
    },
    {
      "id": "3876",
      "title": "Amazon"
    },
    {
      "id": "3884",
      "title": "МИА «Россия сегодня»"
    },
    {
      "id": "3886",
      "title": "Дизайн-бюро «Щука»"
    },
    {
      "id": "3912",
      "title": "Wrike"
    },
    {
      "id": "3913",
      "title": "Кнопка"
    },
    {
      "id": "3930",
      "title": "Borland (A Micro Focus Company)"
    },
    {
      "id": "4079",
      "title": "Wowlookat.com"
    },
    {
      "id": "4111",
      "title": "Charmer"
    },
    {
      "id": "4126",
      "title": "Pushwoosh, Inc"
    }
  ],
  "lecture": [
    {
      "id": "1068",
      "title": "Опыт применения Go в Dropbox в SRE",
      "description": "Тезисно: \n\n \t* Исторические причины, почему начали смотреть на Go.\n \t* Особенности задач в Dropbox.\n \t* Почему Python не подошёл для новых задач.\n \t* Для каких задач сейчас используется Go в Dropbox.\n \t* Краткий обзор экосистемы Go.\n\nЯ рассчитываю в докладе на людей, которые только слышали про Go, либо только начали пробовать.",
      "day_id": 2,
      "section_id": "130",
      "speaker_id": "10479",
      "time_start": "14:30:00",
      "time_end": "15:10:00"
    },
    {
      "id": "1069",
      "title": "Подружили CLR и JVM в Project Rider",
      "description": "Не так давно компания JetBrains анонсировала Project Rider: новую крутую кроссплатформенную C# IDE. Но вот только писать новую IDE с нуля — дело сложное. Поэтому было решено попробовать скрестить ReSharper (тысячи анализаторов кода, рефакторинги, навигация, генераторы кода и прочие ништяки) и Intellij IDEA (просто очень хорошая IDE). Но вот проблема: один продукт написан под CLR, а другой — под JVM. Как же их подружить? Над этой задачей днями и ночами работала команда бесстрашных программистов, вдохновлённых идеей о светлом будущем и новой замечательной средой разработки под .NET. И знаете что? Чудо инженерной мысли работает! Более того: работает хорошо и очень быстро! \n\nВ докладе я расскажу про следующие вещи: \n\n \t* Что такое Project Rider, что он умеет.\n \t* Как мы дошли до такой жизни и почему такой продукт появился на свет.\n \t* Закулисная будничная жизнь разработчиков Rider-а\n \t* Технологическая сторона вопроса: как оно вообще работает и с какими проблемами пришлось столкнуться.\n\n Видеоприглашение",
      "day_id": 1,
      "section_id": "135",
      "speaker_id": "10480",
      "time_start": "12:20:00",
      "time_end": "13:00:00"
    },
    {
      "id": "1070",
      "title": "Настоящее и будущее PostgreSQL",
      "description": "Мир данных непрерывно меняется — они становятся разнообразнее, все чаще встречается требования онлайн-работы с терабайтами данных и одновременной\nработы большого числа сервисов. Уже сейчас основными потребителями и производителями данных являются машины, а не человек. Мы спокойно говорим\nпро BigData, многоядерные машины с терабайтами памяти, объединенные в кластеры и петабайтные хранилища. Мир баз данных тоже меняется, появились\nсотни новых баз данных и это говорит о том, что традиционные СУБД не успевают за новыми требованиями. В тоже время, традиционные универсальные СУБД являются проверенным и надежным инструментом для работы с данными,\nпоэтому они также вступили в гонку за потребителя. \n\nМы расскажем о том, как разработчики PostgreSQL видят его будущее и что уже сейчас он может предложить архитекторам новых приложений.",
      "day_id": 2,
      "section_id": "130",
      "speaker_id": "5361",
      "time_start": "17:50:00",
      "time_end": "18:30:00"
    },
    {
      "id": "1071",
      "title": "Анализ внутренних изменений PHP 7",
      "description": "Новая версия PHP принесла невероятное увеличение производительности. Я расскажу об извилистом пути, который привел нас к успеху, причинах низкой производительности PHP 5, принятых технических решениях, изменениях в самых важных внутренних структурах данных и алгоритмах, улучшениях в интерпретаторе и критически важных подсистемах. Доклад рассчитан на \"продвинутую\" аудиторию и перегружен техническими подробностями выходящими далеко за рамки обычного использования PHP.\n\nДоклад может быть интересен как адептам PHP так и его противникам. Речь скорее пойдет о системном програмировании и виртуальной машие PHP. Так что разработчики на C/C++ вполне могут что-то подчерпнуть.",
      "day_id": 2,
      "section_id": "130",
      "speaker_id": "10481",
      "time_start": "13:40:00",
      "time_end": "14:20:00"
    },
    {
      "id": "1072",
      "title": "Docker & Badoo: никогда не останавливайся на достигнутом",
      "description": "\t* внедряя/эксплуатируя любой продукт нужно помнить, что всегда есть пространство для улучшений - Docker не исключение \n \t* не всегда стоит бросаться улучшать до тех пор, пока не закрыта определенная стадия внедрения \n \t* не забывать свои идеи, даже если в данный момент они не пригодились - всему своё время \n\n\t* \n\nхотите послушать о том, как мы адаптируем Docker для использования в Badoo - приходите",
      "day_id": 2,
      "section_id": "130",
      "speaker_id": "5365",
      "time_start": "11:00:00",
      "time_end": "11:40:00"
    },
    {
      "id": "1073",
      "title": "Асинхронные сетевые приложения на Python. Вчера, сегодня и завтра",
      "description": "aiohttp это библиотека для работы с HTTP построенная на asyncio.\nОна позволяет писать удобный код, который выглядит как хорошо известный линейный (библиотека запросов для клиента и Django/Flask/Pyramid для сервера), но использует мощь неблокирующих сокетов и изначально поддерживает веб сокеты. \n\nОписываются основные шаблоны программирования для клиентского и серверного API, а так же более продвинутые техники, такие как серверные сигналы и middleware. \n\nОсновная цель доклада - показать альтернативу людям кто хочет избежать ограничений классических WSGI фраемфорков, но в то же время находят Twisted и Tornado слишком громоздкими.",
      "day_id": 2,
      "section_id": "130",
      "speaker_id": "10482",
      "time_start": "15:20:00",
      "time_end": "16:00:00"
    },
    {
      "id": "1074",
      "title": "Изолируем компоненты в CSS",
      "description": "В основе эффективной разработки лежит разбиение задачи на маленькие, изолированные компоненты. Именно поэтому так популярен БЭМ. Но в 2016 наметился кардинальный сдвиг в изоляции CSS. С появлением PostCSS и CSS-в-JS мы можем сделать инструменты, которые изолируют надежнее и проще, чем БЭМ. Я расскажу на примере PostCSS и JSS, как правильно писать компоненты и как это изменит веб-разработку.",
      "day_id": 1,
      "section_id": "133",
      "speaker_id": "10483",
      "time_start": "11:30:00",
      "time_end": "12:10:00"
    },
    {
      "id": "1075",
      "title": "Event-Sourcing your React-Flux applications",
      "description": "Most React-Flux applications just store the data being edited as is in a database. It is perfectly fine to treat data in a simple CRUD fashion like this with a smaller application. However this is not optimal when applications get more complex. For more complex applications using the Command Query Responsibility Segregation (CQRS) design pattern is better. And cobining this with Event-Sourcing (ES) is an even more powerful solution. With Event-Sourcing every action leading up to the current state is stored as a separate domain event. This collection of domain events is then used as the write model in the CQRS model. These same events are projected out to a secondary database to build the read model for the application. In this session Maurice de Beijer will explain why you might want to use Event-Sourcing and how to get started with this design in your React and Flux applications.",
      "day_id": 1,
      "section_id": "133",
      "speaker_id": "10484",
      "time_start": "17:20:00",
      "time_end": "18:00:00"
    },
    {
      "id": "1076",
      "title": "Building IoT devices for fun and profit",
      "description": "The internet of things era is finally starting to happen! We have billions of smart devices coming, from smart plants to smart suitcases, and from smart vending machines to smart toys. But How can we, as ordinary developers, ride this wave? We'll need to know how to build embedded devices, build smartphone apps to go with them, and connect devices to the internet. And when we're all done: how can people even discover our devices?! \n\nLots of challenges, but one great opportunity. With new tech coming out every day, it gets easier and easier to solve these problems. On the hardware spectrum ARM just launched mbed, which promises to make designing smart devices not only easy, but also allows developers to take the hardware reference designs and go quicker into production. And on the software spectrum Google and Mozilla have been working like crazy on WebBluetooth, eliminating the need for an app per device. And on top of that: Physical Web, an open protocol that gives ordinary devices a URL, automatically popping up in your homescreen when you're close to the device. How is that for discovery? \n\nIn this demo heavy talk, Jan Jongboom will balance the fine line between hardware and the web, showing how to get started on building connected devices on both sides. And while he's at it, he'll probably throw some stuff in the air. \n\nThis talk should be appropriate for any mid-level developer. The goal is to make people step outside their standard box. Low-level devs will be thrilled to see how far the web platform has come, and web devs will see that embedded work is not as scary as it seems.",
      "day_id": 2,
      "section_id": "134",
      "speaker_id": "10485",
      "time_start": "11:00:00",
      "time_end": "11:40:00"
    },
    {
      "id": "1077",
      "title": "Расширяем инструментарий — тулзы пентестеров в разработке и тестировании",
      "description": "Разработчики и тестировщики уже применяют большое количество замечательных инструментов. А что, если их дополнить? Одна из задач при работе по анализу защищенности это иметь возможность дебажить самые разные и узкие места приложений, автоматизировать с минимальными усилиями типичные проверки, попутно адаптируя их под самые разные сценарии. Цель данного доклада рассказать о таких инструментах, их функционале и реальных кейсах применения, в том числе при тестировании безопасности.",
      "day_id": 1,
      "section_id": "129",
      "speaker_id": "4773",
      "time_start": "15:40:00",
      "time_end": "16:20:00"
    },
    {
      "id": "1078",
      "title": "The Story of Appium: Lessons Learned Creating an Open Source Project 0 to 100,000 users",
      "description": "When I demo'ed what is now called Appium at the Selenium Conference in 2012 I had no idea what I was doing starting an open source project. I knew little about how open source operated and worked behind the scenes. Thanks to the help of a great community and the advice of some seasoned open source contributors, Appium has quickly become the most popular open source mobile automation framework. Along the way, mistakes were made, lessons were learned, and occasionally we got things right. I've put together a collection of stories and lessons that I'd like to share with others to help everyone manage, contribute to, and consume open source software projects more effectively.",
      "day_id": 1,
      "section_id": "129",
      "speaker_id": "10486",
      "time_start": "13:10:00",
      "time_end": "13:50:00"
    },
    {
      "id": "1079",
      "title": "Model Based Testing",
      "description": "Model based testing [MBT], is a technique to design tests for automated verification. But it's much more than just design. It will also automatically create different kind of tests for you. When the time comes to actually execute the tests, MBT can do that for you as well.\nKristian Karl will walk you through how MBT works. He will demonstrate it, using real use cases, discussing the benefits, the pros and cons.\nKristian will only use open source and free tools, thus enabling anyone interested to try it out for themselves.",
      "day_id": 1,
      "section_id": "129",
      "speaker_id": "10487",
      "time_start": "14:00:00",
      "time_end": "14:40:00"
    },
    {
      "id": "1080",
      "title": "То, что русскому — ФРИИ, финну — Startup Sauna. Опыт прохождения акселерации на примере одного стартапа",
      "description": "Поделюсь опытом прохождения акселерации во ФРИИ и Startup Sauna (Хельсинки, Финляндия) на примере стартапа, которым сейчас занимаюсь.\n\n \t* Зачем проходить акселерацию стартапу?\n \t* Есть ли в ней смысл?\n \t* Если есть, то зачем вторая-третья-... акселерации?\n \t* Разница подхода к стартапам в России и Финляндии, сравнение \"без купюр\"",
      "day_id": 2,
      "section_id": "132",
      "speaker_id": "9786",
      "time_start": "12:50:00",
      "time_end": "13:30:00"
    },
    {
      "id": "1081",
      "title": "Working in a fast growing company",
      "description": "It has been an incredible journey. Almost surreal. When I started at Spotify, there were perhaps 50 people working within the technology department. Six years later, we are more. A lot more.  \n\nAs a manager, my challenges are finding talented and skilled people. But also, keeping them.  \n\nMy story will be that journey. How we at Spotify have been working and organizing ourselves, to cope and keep up with this great growth",
      "day_id": 2,
      "section_id": "132",
      "speaker_id": "10487",
      "time_start": "15:20:00",
      "time_end": "16:00:00"
    },
    {
      "id": "1082",
      "title": "Развитие процессов тестирования в Badoo за три года или как мы думали, что всё хорошо, а оказалось, что можно лучше",
      "description": "В рамках этого доклада я поведаю:\n\n \t* Как строилось тестирование в Badoo три года назад и почему мы думали, что это здорово\n \t* С какими проблемами мы встретились и почему стали понимать, что нужно что-то совершенствовать;\n \t* Как мы изменили у улучшили наши процессы за последние три года и как нам это помогло;\n \t* Какие сложности мы всё ещё испытываем и как планируем их решать",
      "day_id": 1,
      "section_id": "129",
      "speaker_id": "5407",
      "time_start": "11:30:00",
      "time_end": "12:10:00"
    },
    {
      "id": "1083",
      "title": "Deliver fast, on time and with high quality",
      "description": "\"Deliver fast, on time and with high quality\"\nWe hear this quote frequently, in small and large companies around the world. My team and I have been a part of this evolution. I was asked to join an ambitious project at work. My task, was to build a team to be the first DevTest group in my organization.\nThe journey I will share with you is how to integrate the agile mindset into your non-agile team, focusing on methodologies, techniques, and technologies.",
      "day_id": 1,
      "section_id": "129",
      "speaker_id": "10490",
      "time_start": "14:50:00",
      "time_end": "15:30:00"
    },
    {
      "id": "1084",
      "title": "Чистая архитектура с VIPER",
      "description": "Писать чистый и тестируемый код с помощью стандартной для мобильной разработки парадигмы MVC крайне сложно. Все выливается в огромные контроллеры, которые тяжело изменять и невозможно покрыть тестами. В своем выступлении я расскажу о VIPER - подходе к архитектуре приложений, помогающем писать чистый и понятный код. \n Я расскажу об истории появления VIPER, о том, какие проблемы в этой архитектуре мы нашли в Rambler&Co и как их решили, и продемонстрирую проектирование с VIPER на примере реального приложения.",
      "day_id": 2,
      "section_id": "134",
      "speaker_id": "10491",
      "time_start": "17:50:00",
      "time_end": "18:30:00"
    },
    {
      "id": "1085",
      "title": "Live Objects with Realm",
      "description": "Value Objects are preached by followers of the functional reactive programming paradigm in the mobile development community. They are neat, but Live Objects have their own advantages as well. They always reflect the latest modifications across threads and processes. This talk reminds of those and explains how they give a whole new experience when working with persistency as given by the Realm database. Beside a general introduction in both concepts and their differentiation, you can expect a technical deep dive in how the Realm Cocoa bindings are implementing them.",
      "day_id": 2,
      "section_id": "134",
      "speaker_id": "10492",
      "time_start": "13:40:00",
      "time_end": "14:20:00"
    },
    {
      "id": "1086",
      "title": "How to create a successful open source product",
      "description": "Making a product like MySQL / MariaDB\nThe business model (issues and findings), creating a team, development processes, reporting",
      "day_id": 2,
      "section_id": "132",
      "speaker_id": "10493",
      "time_start": "16:10:00",
      "time_end": "16:50:00"
    },
    {
      "id": "1087",
      "title": "Open Source by Default",
      "description": "Open Source by Default is an idea that we all can do better, provide more resources for each other and start to expand the spheres of influence for the code we write. By trying to open as much of our process and work to each other, we open ourselves to a lot more possibilities.",
      "day_id": 1,
      "section_id": "135",
      "speaker_id": "10494",
      "time_start": "10:20:00",
      "time_end": "10:50:00"
    },
    {
      "id": "1088",
      "title": "(Web?) Components in production",
      "description": "Today the AWS Management Console is created by more than 40 different teams across the world. Each team develops their part of the UI using a wide range of development frameworks and programming languages. This leads to a huge amount of effort spent on creating the same widget set over and over. It also lowers the customer experience by having slight differences from page to page. \n\nOur team is solving this challenge with a set of framework agnostic components. Initially we started with the idea of the extensible web and web components. However, along the way we learned that we have take a different route. I'll show the unique problems caused by the environment we run in, and how we solved them. I will also go into the technical details of our solution and show how we use our components with other frameworks including GWT, Angular, and React.",
      "day_id": 1,
      "section_id": "133",
      "speaker_id": "10495",
      "time_start": "14:50:00",
      "time_end": "15:30:00"
    },
    {
      "id": "1089",
      "title": "Можно вообще всё. Раскладка по гриду",
      "description": "Верстаете как юный бог на флексах или пасёте флоуты по углам — неважно. Когда-нибудь вам придётся перейти на грид-раскладки. Не просто инлайн-блоки на стероидах, как флексы, а принципиально новую систему, созданную специально для сложных раскладок. Понятное введение и примеры использования для реальных задач.",
      "day_id": 1,
      "section_id": "133",
      "speaker_id": "4443",
      "time_start": "13:10:00",
      "time_end": "13:50:00"
    },
    {
      "id": "1090",
      "title": "Жизнь HTML в iOS приложении",
      "description": "Расскажу когда и для чего нативному приложению использовать web-технологии. Как у нас проходит разработка для мобильного приложения, и чем она отличается от привычного процесса фронтенд-разработки. Как сделать html-страницу похожей на приложение, чтобы сохранить чувство \"нативности\".",
      "day_id": 1,
      "section_id": "133",
      "speaker_id": "7280",
      "time_start": "16:30:00",
      "time_end": "17:10:00"
    },
    {
      "id": "1091",
      "title": "What is new in ASP.NET Core?",
      "description": "The next version of ASP.NET is more than just a simple upgrade from the current version. Instead the next version will be quite different and re-engineered from the ground up. Why this big change? Microsoft wants ASP.NET Core to be the stack to build lean and modern web applications. These applications can run both on your own servers as well as in the cloud. To meet these ambitious goals they have decided to remove old and deprecated API's. This means they have started all over with a completely new unified stack. This new stack is not just a replacement for the ageing System.Web.dll assembly. Instead they are all in and are even including a completely new CLR named CoreCLR. This CoreCLR is optimized for cloud hosted applications. As a final twist this new CoreCLR is no longer tied to just Windows. In the future they will also be support in Linux and Mac OS and can even run your application in a Docker container.",
      "day_id": 1,
      "section_id": "135",
      "speaker_id": "10484",
      "time_start": "15:40:00",
      "time_end": "16:20:00"
    },
    {
      "id": "1093",
      "title": "Маркетинг количественный и эмпирический",
      "description": "Чем больше маркетинг становится количественной эмпирической наукой, тем важнее умение менеджеров, разработчиков и маркетологов разговаривать на одном языке и вместе планировать максимальную измеряемость как самого продукта, так и маркетинговых действий вокруг него.",
      "day_id": 2,
      "section_id": "132",
      "speaker_id": "10497",
      "time_start": "11:00:00",
      "time_end": "11:40:00"
    },
    {
      "id": "1096",
      "title": "Kubernetes: lessons learnt from cluster management at Google",
      "description": "Start with introduction to cluster management at Google with the focus on the following problems: isolation, scheduling, optimization of resource utilization, automation of deployments. The second part of the presentation will focus on explaining how Kubernetes is designed to solve the same problems.",
      "day_id": 2,
      "section_id": "130",
      "speaker_id": "10499",
      "time_start": "12:00:00",
      "time_end": "12:40:00"
    },
    {
      "id": "1097",
      "title": "Автоматизация тестовой инфраструктуры в 2ГИС",
      "description": "Без повторяемого и легко развертываемого тестового окружения, которое приближено к бою, мы не можем говорить о достоверных результатах автотестов. \n\nПоговорим о том: \n\n \t* Какие проблемы с инфраструктурой стояли перед командами\n \t* Как от этого страдали процессы разработки и тестирования\n \t* Как мы внедрили OpenStack\n \t* Какие у нас есть сценарии использования OpenStack\n \t* Как автоматизация получила дополнительный толчок в развитии и начали появляться новые внутренние продукты",
      "day_id": 1,
      "section_id": "129",
      "speaker_id": "8486",
      "time_start": "16:30:00",
      "time_end": "17:10:00"
    },
    {
      "id": "1098",
      "title": "Построение Read Model-ей с использованием потоков событий",
      "description": "Вы когда-нибудь сталкивались с подобными проблемами? \n\n \t* Данные приложения хорошо структурированы для изменения, но запросы на чтение получаются (очень) сложными\n \t* Выделяются различные наборы запросов на чтение над одной схемой данных, каждый из таких наборов - для решения бизнес-задач в разных, часто непересекающихся, областях. Или даже больше: есть несколько приложений, которые читают одни и те же данные\n \t* Запросы на чтение выполняются медленно\n \t* Структура данных меняется очень часто, поэтому приходтся поддеживать обновления и в кейсах записи, в кейсах чтения, даже если требования к кейсам чтения не меняются\n \t* Всегда приходится искать компромисс между запросами на чтение и запросами на запись при попытках оптимизировать работу с хранилищем данных (например, при создании индексов в SQL хранилищах)\n\nВ своем выступлении я расскажу как тут помогает применение CQRS. Минимум теории, максимум практических деталей из реального опыта и куча опенсорса.",
      "day_id": 1,
      "section_id": "135",
      "speaker_id": "4785",
      "time_start": "14:00:00",
      "time_end": "14:40:00"
    },
    {
      "id": "1099",
      "title": "Нетривиальное о репликации: как добиться высокой доступности",
      "description": "Стандарты отрасли требуют от нас, разработчиков, легко масштабируемых и отказоустойчивых решений. Для этого мы проектируем наши продукты в парадигме сервисно-ориентированной архитектуры, и запускаем каждый компонент в таком количестве экземпляров, чтобы продукт не просто справлялся с нагрузкой, а переживал выход из строя части ресурсов.\nКазалось бы, достаточно поставить несколько реплик с запасом за балансировщик и спать спокойно. Но нет, не так все просто. Я много раз видел, как тормоза одной из множества реплик сервиса отражались на производительности продукта в целом.\nС избыточностью нужно уметь грамотно работать.\nЯ расскажу простые, но действенные приемы, которые на практике доказали свою эффективность в нашем сервисе, состоящем из 300 различных компонентов, работающих в 2000 экземплярах и взаимодействующих по сети.",
      "day_id": 1,
      "section_id": "135",
      "speaker_id": "4282",
      "time_start": "14:50:00",
      "time_end": "15:30:00"
    },
    {
      "id": "1100",
      "title": "Синхронизация без блокировок и СМС",
      "description": "Хорошо известно, что блокировки — это не очень здорово: нужно понимать, где взять блокировку, где ее отпустить и как сделать так, чтобы блокировка (а точнее, критическая секция) не была узким местом в вашем приложении. \n\nСинхронизация без блокировок возможна — для этого используются так называемые универсальные операции, то есть, операции типа Compare-And-Set (CAS). В этом докладе мы поговорим о том, что такое CAS-операции и о том, что на эту тему есть в Java и C#. Мы поговорим про семантику таких операций с точки зрения Java и C# Memory Model и про особенности их реализации как в разных версиях JDK/JVM, так и на разном железе. Будут показаны несколько базовых идиом, на которых базируется неблокирующая синхронизация и алгоритмы без блокировок. \n\nДоклад будет полезен как тем разработчикам, которые слышали про атомики и неблокирующую синхронизацию, но не пользовались ей в продакшене, так продвинутым девелоперам, которые интересуются теорией многопоточности или особенностями реализации многопоточности на современных платформах. \n\n_Тема и тезисы уточняются_",
      "day_id": 1,
      "section_id": "135",
      "speaker_id": "10225",
      "time_start": "11:30:00",
      "time_end": "12:10:00"
    },
    {
      "id": "1101",
      "title": "Диско: рекомендательная система Яндекса",
      "description": "Есть много сервисов, в которых пользователи выбирают и потребляют контент разного типа: музыку, видео, товары, видео, новости, приложения и т.д. Для этого используются рекомендательные системы, благодаря которым улучшается опыт использования сервисов, а за счёт этого — и их ключевые метрики. В Яндексе для этого используется рекомендательная технология Диско, которая достаточно универсальна и расширяема, чтобы работать в разных предметных областях, учитывая их особенности, и при этом достигая внушительных результатов по качеству рекомендаций. Эта система использует машинное обучение для комбинирования подходов коллаборативной фильтрации и рекомендаций на основании контента. Система обеспечивает обучение в реальном времени, поддерживает оптимизацию различных метрик, а также разнообразия, свежести и оригинальности рекомендаций. В моём докладе я расскажу про детали алгоритмов, используемых в системе, и особенности их реализации.",
      "day_id": 1,
      "section_id": "135",
      "speaker_id": "10501",
      "time_start": "16:30:00",
      "time_end": "17:10:00"
    },
    {
      "id": "1102",
      "title": "Что особенного в СУБД для оперативной памяти",
      "description": "Оперативная память становится всё более дешёвой и производительной, что позволяет использовать её для хранения рабочего набора данных всё большего числа приложений. Хранение всех данных в оперативной памяти позволяет сделать их высоко доступными, а алгоритмы для работы с данными либо существенно упростить, либо ускорить, а иногда - и то, и другое. \n\nЧто особенного в in-memory DBMS, и чем работа такой программы отличается от произвольной высоконагруженной системы, написанной на С, С++, Java? \n\nВ своём докладе я расскажу о специализированных алгоритмах и структурах данных для хранения данных в RAM: \n\n \t* аллокация памяти без компромиссов: почему это возможно только в СУБД;\n \t* хэши и ассоциативные массивы: как сделать их не только быстрыми, но и компактными;\n \t* как может быть реализовано конкурентное обновление одних и тех же данных в памяти без блокировок.\n\n\"Узкие места\" в СУБД в памяти настолько существенно отличаются от аналогов в \"классических\" СУБД, что простота и элегантность являются необходимым условием выживания. Борьба идёт за байты и инструкции, и сложный код просто не может работать эффективно. Я расскажу, как простые решения для обработки транзакций в памяти позволяют упростить и ускорить репликацию, откат при аборте транзакции, поддержку \"продвинутых\" возможностей, таких как триггеры и изменение схемы данных.",
      "day_id": 2,
      "section_id": "130",
      "speaker_id": "8947",
      "time_start": "16:10:00",
      "time_end": "16:50:00"
    },
    {
      "id": "1103",
      "title": "MAPS.ME изнутри",
      "description": "\t* История проекта с самого начала. Путь от прототипа до первого релиза, от бесплатной версии к платной, от первой тысячи пользователей до миллионов.\n \t* Самые неприятные технические ошибки, последствия и пути их решения.\n \t* Эффективная кроссплатформенная разработка без дублирования кода.\n \t* Как сэкономить на CDN для петабайта трафика в месяц.\n \t* Плюсы и минусы от перехода в Open Source.",
      "day_id": 2,
      "section_id": "132",
      "speaker_id": "10502",
      "time_start": "14:30:00",
      "time_end": "15:10:00"
    },
    {
      "id": "1104",
      "title": "Девиации и патологии в отношениях с руководителями и подчинёнными",
      "description": "Вы работаете в большой компании и у вас несколько тысяч коллег? Или вы работаете в стартапе в котором не больше 10 человек? Пишете код? Тестируете? Чем бы вы ни занимались, почти наверное у вас есть руководитель. Ну а раз вы зашли на страницу менеджерской сессии, вероятно у вас есть и подчинённые. Не исключено, что вы - менеджер среднего звена, в таком случае вы вовлечены в отношения \"подчинённый-руководитель\" сразу с обеих сторон. А хорошо ли вы понимаете, как выстраивать эти отношения?\nВ своём докладе я расскажу о моделях взаимоотношений руководителей и подчинённых. Мы поговорим о патологиях и опасностях, которые таят в себе некоторые модели, а также о том, когда и как менять устоявшиеся отношения.",
      "day_id": 2,
      "section_id": "132",
      "speaker_id": "4667",
      "time_start": "17:00:00",
      "time_end": "17:40:00"
    },
    {
      "id": "1105",
      "title": "Реактивные грабли",
      "description": "Каждый подход к разработке архитектуры мобильного приложения имеет свои тонкости и часто скрывает недостатки. Реактивная архитектура на ReactiveCocoa или RxJava не исключение. \n\nКруто, когда кто-то прошёл все круги, собрал все грабли и споткнулся обо все подводные камни. А потом ещё и рассказал как идти. \n\nЯ расскажу вам, как избегать ненужной сложности и глупых ошибок. Ошибок, которые кажутся совсем непонятными/неочевидными на первых этапах пути к правильной \"реактивности\".",
      "day_id": 2,
      "section_id": "134",
      "speaker_id": "1156",
      "time_start": "15:20:00",
      "time_end": "16:00:00"
    },
    {
      "id": "1106",
      "title": "Инфографика в МИА «Россия сегодня». Опыт проектной группы",
      "description": "\t* Как делается инфографика в России сегодня? \n \t* Структура новой студии. \n \t* Участники процесса и роли (на примере одной проектной группы). \n \t* Типы (форматы) проектов, реализуемых студией. \n \t* Рассказ о некоторых проектах с кратким разбором дизайн-процесса.",
      "day_id": 1,
      "section_id": "131",
      "speaker_id": "10503",
      "time_start": "11:30:00",
      "time_end": "12:10:00"
    },
    {
      "id": "1107",
      "title": "Создание умных остановок для города",
      "description": "Делать проекты для людей можно. Выиграть в конкурсе у больших фирм можно. Сломать бюрократию можно. Сделать остановки с освещением, бесплатным вайфаем, зарядками для телефонов и тачскрином можно. Все можно.",
      "day_id": 1,
      "section_id": "131",
      "speaker_id": "10504",
      "time_start": "12:20:00",
      "time_end": "13:00:00"
    },
    {
      "id": "1108",
      "title": "Перезапуск системы",
      "description": "Мой рассказ будет интересно услышать всем, кто задумывался о методологии работы над любыми дизайн-продуктами. Много внимания уделим модульным системам. Расскажу про образ и идеологию бренда; исследование и переосмысление контекста; формулирование образа (личность, ценности, идея); методологию проектирования системы; продукт как пластическую и информационную систему; проектирование кроссплатформенного сервиса.",
      "day_id": 1,
      "section_id": "131",
      "speaker_id": "10442",
      "time_start": "14:00:00",
      "time_end": "14:40:00"
    },
    {
      "id": "1109",
      "title": "По секрету всему свету",
      "description": "Крайне важно понимать, на что тратятся силы и как стать ещё полезнее. Как и куда развиваться? Как становиться продуктивнее? Как и в любой профессии, у дизайнеров есть свои секреты. Не вижу смысла больше хранить это в тайне. Как на духу поведаю о самом сокровенном. Пусть все знают. Расскажу о профессии дизайнера, творческих методиках и об отношении к работе.",
      "day_id": 1,
      "section_id": "131",
      "speaker_id": "10505",
      "time_start": "16:30:00",
      "time_end": "18:00:00"
    },
    {
      "id": "1110",
      "title": "Графика и текст. Примеры, работы в визуальной коммуникации",
      "description": "Как подружить графику и текст? Как добиться конечного результата с прочной, продуманной структурой, который ещё и смыслом давит, и словом разит? Визуальная коммуникация и дизайн-проектирование, во всей красе. Будем смотреть на работы и разбирать примеры, коих очень много, в том числе и в наших студийных проектах. Так же поделюсь опытом, как мы оформляли The Prime Russian Magazine, \"Большой город\" и \"Московское наследие\".",
      "day_id": 1,
      "section_id": "131",
      "speaker_id": "10506",
      "time_start": "13:10:00",
      "time_end": "13:50:00"
    },
    {
      "id": "1111",
      "title": "Angular 2: новая надежда",
      "description": "Со времени своего появления в 2009 году Angular пережил несколько фаз развития. Поначалу он потрясал умы своими возможностями, однако со временем начал отставать от своих конкурентов. Сейчас же от прошлого величия осталась лишь тень, былой Angular уже не может соперничать с такими титанами как React или Polymer (по крайней мере по популярности). Сможет ли вторая версия исправить недостатки первой и дать новую надежду? Об этом вы узнаете на выступлении.",
      "day_id": 1,
      "section_id": "133",
      "speaker_id": "10554",
      "time_start": "12:20:00",
      "time_end": "13:00:00"
    },
    {
      "id": "1112",
      "title": "Горькая правда о Холакратии",
      "description": "Холакратия очень громко и решительно кричит с трибун о том, что менеджеры отныне не нужны, можно уволить всех сотрудников-перемычек и жить счастливо в большой и дружной семье.\nНа практике все оказывается не так красиво и, как говорится в пословице, и в вашей новообретенной семье всегда найдется место уроду.\nТяготы внедрения холакратии на примере Кнопки.\n\nИнформация будет полезна всем: от маленького стартапа до разросшейся до неприличия компании.\nПодойдет как новичку в холакратии, так и матерому адепту.",
      "day_id": 2,
      "section_id": "132",
      "speaker_id": "10555",
      "time_start": "17:50:00",
      "time_end": "18:30:00"
    },
    {
      "id": "1113",
      "title": "Оценка и планирование сроков в Agile",
      "description": "В традиционных подходах к разработке, оценки трудоёмкости обычно делаются экспертно, разработчиками или архитектором. С этим подходом есть две проблемы. Во-первых, оценки обычно даются в человеко-днях. Но человеко-дни потом очень трудно правильно перевести в календарное время. Их начинают умножать на всякие коэффициенты, которые отличаются от команды к команде и от разработчика к разработчику. Потом нужно попытаться учесть все риски, и сдвинуть прогноз по сроку соответственно. Весь этот процесс непрозрачен и прячет проблемы с оценками на каждом из этапов. Если в итоге сроки начинают съезжать, потом бывает очень трудно разобраться, где именно были допущены ошибки. Обычно это заканчивается взаимными претензиями и переводом стрелок между участниками процесса и обычно не приводит к улучшениям. \n\nКроме того, чтобы экспертно оценить время на ту или иную доработку, обычно нужно достаточно глубоко её спроектировать. Если при этом заказчики просят точных оценок, то трудоёмкость самого процесса оценки становится достаточно большой. Кроме того, если потом планы меняются и решение нужно переделать, эта работа просто идёт на выброс. \n\nAgile предлагает альтернативный подход к оценкам, и целый ряд инструментов, которые его обеспечивают. В Agile оценки даются не экспертно, а на основании статистических данных о скорости разработки за прошлые периоды. В своём докладе я расскажу о том, как даются такого рода оценки, какие для этого существуют инструменты и практики, и как их использовать для получения прогнозов по срокам завершения задач и проектов.",
      "day_id": 2,
      "section_id": "132",
      "speaker_id": "10630",
      "time_start": "12:00:00",
      "time_end": "12:40:00"
    },
    {
      "id": "1114",
      "title": "Как тестировать приложение, предназначенное для тестирования приложений?",
      "description": "Допустим, вы мастерили весы и начали поставлять их в овощные ларьки на базарах. Но, так получилось, что весы занижают реальные показатели. В итоге продавец разорился, а покупатель заболел гипервитаминозом.\nА теперь представьте, что вместо весов — инструмент для автоматизированного нагрузочного тестирования, а вместо рынка — онлайн магазин.\nЕсли с покупкой айфона со скидкой в 90% можно и подождать из-за того, что сайт магазина \"упал\" от наплыва покупателей, то ошибка в работе одного из модулей МРТ может стать фатальной.\nПоэтому очень важно быть уверенным, что сам инструмент для тестирования работает корректно и предоставляет верные данные.\nВ докладе я расскажу, как автоматизировать процесс тестирования инструмента для автоматизированного нагрузочного тестирования.\n\nДоклад будет интересен как QA, так и разработчикам; всем, кто сталкивался с процессом автоматизированного тестирования и сопутствующими ему проблемами.",
      "day_id": 1,
      "section_id": "129",
      "speaker_id": "10598",
      "time_start": "17:20:00",
      "time_end": "18:00:00"
    },
    {
      "id": "1115",
      "title": "\"Конструктор\", или идеальный порядок в большом проекте",
      "description": "SERP (или просто страница результатов поисковой выдачи) — это действительно большой проект. Над ним работают около 40 фронтендеров из разных городов. И даже модульная архитектура не слишком спасала нас от странных, неочевидных зависимостей, лишних стилей, десяти вариантов серых ссылок, и нескольких разных реализаций почти одинаковых компонентов. \n\nПроцесс разработки новой, даже довольно простой на первый взгляд фичи, занимал чудовищное количество времени, и представлял из себя хаотичное взаимодействие большого количества людей: фронта, бэкэнда, дизайнеров и менеджеров. \n\nВ общем стала закрадываться мысль, что пора что-то менять. И мы поменяли. \n\nВ докладе я расскажу о том, как мы с помощью проекта на стыке фронтендеров, менеджеров, и дизайнеров, навели во всем этом идеальный порядок. Каким образом поменяли наш код процессы и инструменты, а так же что нам это дало и как будем жить с этим дальше. \n\nЕсли вам знакомы похожие проблемы, то наш опыт может оказаться вам чертовски полезным.",
      "day_id": 1,
      "section_id": "133",
      "speaker_id": "10654",
      "time_start": "15:40:00",
      "time_end": "16:20:00"
    },
    {
      "id": "1116",
      "title": "Воспитай в себе обезьяну!",
      "description": "Вы помните мой рассказ о тупняке на прошлом CodeFest-е? (Если что, его всегда можно посмотреть: http://www.youtube.com/watch?v=RbOkgLa1XjM). На мой взгляд, огромное количество организационных проблем начинаются на уровне личной эффективности. А потому, оптимизируя работу команды, отдела или компании очень важно начинать с себя и себе подобных. \n\nК настоящему моменту человечество создало огромное количество методов совершенствования личной эффективности, но в них очень часто опускается маленькая деталь Как бы это обидно не звучало, но Большую часть времени, бОльшая часть людей: импульсивны, нелогичны и действуют на автомате (порой, даже хуже, чем обезьяны). В результате чего большая часть советов, опирающихся на нашу рациональность, перестают работать.\nВ мире рациональных людей все на много проще. Вы прокрастинируете? Ничего страшного, просто каждый день с утра начинайте делать важные задачи до просмотра фейсбука. И не откладывайте ничего важного на последний момент. У вас много входящей почты? Просто перестаньте обращать внимание на неважные сообщения и отвечайте только на важные. В теории все просто. И вроде как в теории разницы между теорией и практикой быть не должно. Беда в том, что на практике эта разница есть. Об этом и пойдет речь в моем утреннем, воскресном, и для кого-то похмельном рассказе",
      "day_id": 2,
      "section_id": "132",
      "speaker_id": "3185",
      "time_start": "10:00:00",
      "time_end": "10:40:00"
    },
    {
      "id": "1123",
      "title": "Многозадачность как имплементация Unit Of Work",
      "description": "\t* Проблемы и задачи классических подходов. \n\n \t* Long running operations. Распространенные типы задач, ограничения.\n \t* Шаблонные операции, влияющие на workflow задач.\n\n  \t* Unit of Work, компановщики задач. Варианты параллельной или последовательной компановки, преимущества, недостатки.\n \t* Планировщик задач, кеширование, понятие схожести операций.\n \t* Фоновые задачи и приоритезация\n \t* Особенности тестирования.",
      "day_id": 2,
      "section_id": "134",
      "speaker_id": "10830",
      "time_start": "12:00:00",
      "time_end": "12:40:00"
    },
    {
      "id": "1124",
      "title": "Комбайны безопасности для iOS и Android",
      "description": "Доклад о том как можно в домашних условиях без особых знаний в области информационной безопасности можно проверять свои Android и iOS приложения на наличие базовых недостатков и уязвимостей. Доклад для тех кому не безразлична безопасность своих приложений и сохранность пользовательских данных.",
      "day_id": 2,
      "section_id": "134",
      "speaker_id": "10839",
      "time_start": "16:10:00",
      "time_end": "16:50:00"
    },
    {
      "id": "1126",
      "title": "Путь от монолита на PHP к микросервисам на Scala",
      "description": "В своём проекте мы решали следующие задачи: \n\n \t* Скорость разработки задачи;\n \t* Стоимость поддержки задачи;\n \t* Возможность распараллеливать вычисления и задачи;\n \t* Возможность максимально просто масштабировать приложение;\n \t* CI/CD с минимальными усилиями.\n\nЯ расскажу о том, как мы решали эти задачи, на какие грабли мы наступали, что из этого всего получилось, и что делать дальше. \n\nЧто получили в итоге: \n\n \t* Мощь JVM под капотом Scala;\n \t* 15 минут от нажатия на кнопку \"Merge request\" до продакшена в 3 датацентра и 6 серверов с прохождением тестов (юнит + функциональные + интеграционные + нагрузочные);\n \t* 6 нод с приложениями вместо 18 (по 2 в каждом датацентре для отказоустойчивости) с запасом прочности в 60%;\n \t* Независимые пофичные релизы без даунтайма всех компонентов приложения;\n \t* Масштабирование только того функционала и в том количестве, которое необходимо данному сервису.",
      "day_id": 2,
      "section_id": "130",
      "speaker_id": "3944",
      "time_start": "17:00:00",
      "time_end": "17:40:00"
    },
    {
      "id": "1127",
      "title": "JVM: краткий курс общей анатомии",
      "description": "Если мы говорим про Java, то мы говорим про JVM, виртуальную Java машину, и про Java байткод, который исполняется на этой машине. \n\nВнутреннее устройство JVM — непростое, но если ваша профессиональная карьера связана с Java или с другим языком на JVM, то очень важно понимать из каких частей состоит JVM, какая часть за что отвечает и как это все вместе работает хотя бы в самых общих чертах: это вам поможет в понимании того, как работает ваша программа. \n\nВ этом докладе мы не будем лезть в кишки какой-то конкретной реализации JVM, однако мы покажем где кишки у JVM находятся, а также где находятся и для чего служат печень, сердце, почки, мозг и другие органы.",
      "day_id": 1,
      "section_id": "135",
      "speaker_id": "4234",
      "time_start": "17:20:00",
      "time_end": "18:00:00"
    },
    {
      "id": "1129",
      "title": "Meduza и Arzamas",
      "description": "Продуктовая история о том, как зарождались \"Медуза\" и \"Арзамас\". Какие концепции и подходы использовали, на какие грабли наступали, как работали со статистикой и какие делали выводы. Поговорим о редакторских процессах, способах управления большим количеством данных. Расскажем, как для разного типа контента подобрать визуализацию. Всё это дополним добротным опытом тесной работы дизайнера и технолога, показав на этом примере, как можно создавать удобные и качественные продукты. \n\nMeduza. Как создавалось новое независимое СМИ\n\n \t* история возникновения \"Медузы\"\n \t* идея и задачи проекта\n \t* формирование концепции ресурса, первые подходы\n \t* первая версия\n \t* работа над ошибками, новая концепция\n \t* вторая версия \"Мониор\"\n \t* редакторкие процессы и панель управления \n\n Case study: Arzamas.Academy \n\n \t* общая вводная часть о проекте, что такое Arzamas, аналоги и сравнение с ними\n \t* зарождение идеи, изменения, которые идея претерпела до момента начала работы над ней \n \t* формирование концепции ресурса, первые подходы \n \t* основные сущности, которые есть на сайте, различия в их визуализации\n \t* интерактивные функции образовательного сайта\n \t* анализ статистики, недочеты, ошибки и пути их решения\n \t* редакторкие процессы и панель управления\n \t* взаимодействие внутри студии при работе над крупными проектами, рабочие инструменты и сервисы",
      "day_id": 1,
      "section_id": "131",
      "speaker_id": "11031",
      "time_start": "15:40:00",
      "time_end": "16:20:00"
    },
    {
      "id": "1130",
      "title": "Parse всё. Куда бежать и что делать?",
      "description": "\t* История вопроса. Что можно (было) сделать с помощью Parse и почему он был так популярен.\n \t* Пара слов о Parse Server.\n \t* Как взлететь на комбайне из Parse Server + Heroku + MongoLabs + Pushwoosh.\n \t* Немного инсайдов о причинах закрытия.\n \t* Выводы. На что имеет смысл обращать внимание, выбирая облачного провайдера (на примере Pushwoosh).",
      "day_id": 2,
      "section_id": "134",
      "speaker_id": "9908",
      "time_start": "12:50:00",
      "time_end": "13:30:00"
    },
    {
      "id": "1137",
      "title": "Аналитика мобильного проекта - проверяй и доверяй",
      "description": "\"...А во Flurry пользователей больше!\" Пожалуй, каждый проект сталкивался с отличающимися значениями метрик в разных платформах аналитики. А что, если эти метрики являются для нас ключевыми? По каким отчетам ориентироваться, принимая решение? \n\n \t* Поделимся опытом AppMetrica - за полтора года разработки собственной системы аналитики мы прошли все стадии принятия неизбежного.\n \t* Расскажем про отличия в расчетах разных платформ аналитики и чем они обусловлены.\n \t* Поделимся опытом сотрудничества с продуктовыми командами разных Яндекс.Приложений, благодаря которым мы выработали собственный подход к расчету основных метрик и можем сказать, что такое \"сессия\" и кто такой \"пользователь\". Разберем сценарии, когда ни один из готовых подходов не подходит.\n \t* Deep Dive в онтологию систем мобильной аналитики - как сделать свою и начать ей доверять.",
      "day_id": 2,
      "section_id": "134",
      "speaker_id": "11084",
      "time_start": "17:00:00",
      "time_end": "17:40:00"
    }
  ],
  "speaker": [
    {
      "id": "1156",
      "title": "Дмитрий Кулижников",
      "description": "Занимаюсь iOS разработкой с 2011 года. Начинал в аутсорсинговой компании, затем участвовал в стартап проекте, а сейчас руковожу группой разработки мобильного 2ГИС под iOS.",
      "post": "Руководитель группы разработки",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1455353581.jpg",
      "company_id": "72",
      "link_facebook": "https://www.facebook.com/profile.php?id=1720672422",
      "link_moikrug": "",
      "link_twitter": "https://twitter.com/Renascence",
      "link_linkedin": "https://ru.linkedin.com/in/kulizhnikov",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "3185",
      "title": "Максим Дорофеев",
      "description": "В 13 лет заработал первые деньги программированием. В 2005 превратился в менеджера, а в 2013 стал тренером-консультантом, сфокусировавшемся на личной эффективности.  \n\nБлог: cartmendum.livejournal.ru \n\nПроекты: mnogosdelal.ru, multiskill.ru",
      "post": "Тренер",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1456325145.jpg",
      "company_id": "1501",
      "link_facebook": "http://www.facebook.com/maxim.dorofeev",
      "link_moikrug": "",
      "link_twitter": "https://twitter.com/cartmendum",
      "link_linkedin": "http://ru.linkedin.com/in/peoplewareengineer/",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "3944",
      "title": "Денис Иванов",
      "description": "Не один год занимается разработкой высокопроизводительных и масштабируемых решений. От низкоуровневых программ и всевозможных утилит до крупного софта и проектирования архитектур больших проектов и систем. Больше года работает в 2ГИС ведущим разработчиком в команде WebAPI.",
      "post": "Ведущий разработчик",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1456909180.jpg",
      "company_id": "72",
      "link_facebook": "",
      "link_moikrug": "",
      "link_twitter": "https://twitter.com/#!/vidogs",
      "link_linkedin": "",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "4234",
      "title": "Никита Липский",
      "description": "Один из инициаторов и руководителей проекта Excelsior JET, сертифицированной реализации Java SE, разрабатываемой компанией Эксельсиор. \n\nРаботая над проектом с 1997 года, поучаствовал в исследовании и разработке практически всех компонент продукта от ядра до продуктовых свойств. \n\nДо проекта Excelsior JET участвовал в разработке объектно-ориентированной базы данных и конструктора графических пользовательских интерфейсов Оберон-2 системы Мифрил (Kronos Reserach Group), а также объектно-ориентированных библиотек для языка Оберон-2 (XDS ltd.). \n\n Видеоприглашение на конференцию:",
      "post": "Менеджер продукта",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1363073518.jpg",
      "company_id": "592",
      "link_facebook": "http://facebook.com/nikita.lipsky.94",
      "link_moikrug": "",
      "link_twitter": "https://twitter.com/#!/pjBooms",
      "link_linkedin": "http://www.linkedin.com/pub/nikita-lipsky/20/639/42",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "4282",
      "title": "Александр Казаков",
      "description": "Занимаюсь разработкой 10 лет.\nПочти всю свою профессиональную жизнь посвятил одному проекту (http://www.kontur-extern.ru/), вместе с которым прошел путь от монструозного веб-приложения до распределенного и отказоустойчивого продукта. В основном занимаюсь \"инфраструктурой\": всем, что связано с хранением, индексацией, межсервисным взаимодействием и построением надежной архитектуры.",
      "post": "Ведущий инженер-программист",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1455349590.jpg",
      "company_id": "134",
      "link_facebook": "",
      "link_moikrug": "",
      "link_twitter": "",
      "link_linkedin": "https://ru.linkedin.com/in/aleksandr-kazakov-01856411",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "4443",
      "title": "Вадим Макеев",
      "description": "Веб-евангелист в Opera, основатель сообщества \"Веб-стандарты\" и организатор конференции Web Standards Days, автор движка для презентаций Shower, автор блога xn—90ahabujzbu.net, пропагандист веб-стандартов.",
      "post": "Веб-евангелист",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1455011794.jpg",
      "company_id": "1221",
      "link_facebook": "http://www.facebook.com/pepelsbey",
      "link_moikrug": "",
      "link_twitter": "https://twitter.com/pepelsbey",
      "link_linkedin": "",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "4667",
      "title": "Степан Колесников",
      "description": "Окончил ФПМИ НГТУ. В 2ГИС пришел в 2009 году в качестве разработчика единственного на тот момент внутреннего продукта в компании. Сейчас Степан руководит разработкой в компании.",
      "post": "Руководитель направления разработки",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1455352697.jpg",
      "company_id": "72",
      "link_facebook": "",
      "link_moikrug": "",
      "link_twitter": "",
      "link_linkedin": "https://ru.linkedin.com/in/stepan-kolesnikov-18529547",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "4773",
      "title": "Сергей Белов",
      "description": "Работает аудитором ИБ в компании Digital Security, последние 5 лет непрерывно занимается анализом защищенности различных информационных систем.\nОпубликовал множество статей по данной теме на ресурсе Хабрахабр и в журнале \"Хакер\". Участвует в программах вознаграждения за найденные уязвимости, получил награды и благодарности от разных вендоров: Google, Digital Ocean (CVE-2014-8144), Yandex, Telegram, ВКонтакте, Badoo, CloudFlare и других.\nВыступил с докладами на различных конференциях в России и мире: CodeFest (2012, 2014), ZeroNights, РИТ++, CEE-SECR, FrontendConf, Hack In Paris, BlackHat USA, OWASP (RU & PL) и продолжает данную деятельность. \n\nКонтакты: https://sergeybelove.ru, https://twitter.com/sergeybelove",
      "post": "Аудитор ИБ",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1454242131.jpg",
      "company_id": "3853",
      "link_facebook": "http://facebook.com/sergeybelove",
      "link_moikrug": "",
      "link_twitter": "https://twitter.com/#!/sergeybelove",
      "link_linkedin": "http://linkedin.com/in/sergeybelove",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "4785",
      "title": "Денис Иванов",
      "description": "Работаю в 2ГИС, решаю задачи в области продаж\nПишу код в основном на C#, но слежу за трендами\nMicrosoft MVP в области Visual Studio and Development Technologies\nУчаствую в нескольких open source проектах и иногда пишу в блоге",
      "post": "Ведущий программист",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1455348798.jpg",
      "company_id": "72",
      "link_facebook": "https://www.facebook.com/ivanovdenis.ru",
      "link_moikrug": "http://ivanoff.moikrug.ru/",
      "link_twitter": "https://twitter.com/denisivanov",
      "link_linkedin": "",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "5361",
      "title": "Олег Бартунов",
      "description": "В 2015 году мы с ведущими PostgreSQL-разработчиками организовали компанию Postgres Professional, в которой я стал генеральным директором. Компания является российским вендором PostgreSQL и занимается внедрением, миграцией, поддержкой и разработкой PostgreSQL. \n\nЯ — профессиональный астроном, а астрономия работает с большими массивами наблюдений, поэтому я в начале 90-х начал работать с СУБД. Постгресом занимаюсь с 1996 года. Мой первый вклад в Постгрес — это поддержка локали, что открыло Постгрес для европейских пользователей, так как изначально он поддерживал только ASCII. Работая над порталом Рамблер (1999 год), настоял на использовании Постгреса, что сильно повлияло на его популярность в России.\nНаиболее известные проекты нашей группы, которые вошли в Постгрес: инфраструктуры расширяемости Постгреса, которые позволяют определять новые типы данных с индексной поддержкой без знания ядра базы данных — GiST, GIN, SP-GiST, contrib/intarray — операторы и функции для эффективной работы с целочисленными массивами, hstore — key-value хранилище с индексной поддержкой, система полнотекстового поиска, contrib/pg_trgm — нечеткий поиск на основе триграм, contrib/ltree — тип данных для работы с древовидными структурами, поиск ближайших соседей. Также, мы разработали тип данных jsonb, который открыл пользователям Постгреса новые возможности \"NoSQL on ACID\". \n\nЯ сделал около 15 докладов на международных конференциях разработчиков Постгреса, активно принимаю участие в российских конференциях (rit, highload), кроме того, компания Postgres Professional ежегодно выступает генеральным партнером и организатором российской конференции PGConf.RU, которая второй год подряд становится самой большой постгресовой конференцией в мире.",
      "post": "CEO Postgres Professional, Научный сотрудник",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1454237894.jpg",
      "company_id": "1446",
      "link_facebook": "http://facebook.com/oleg.bartunov",
      "link_moikrug": "",
      "link_twitter": "",
      "link_linkedin": "",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "5365",
      "title": "Антон Турецкий",
      "description": "30 лет, ВО отсутствует, в Badoo с начала 2011\nпо проектам:\n\n \t* инфраструктурные задачи в badoo (GLPI, Puppet, xCAT);\n \t* внедрение Docker и переезд на него сервисов ~ последние полтора года;\n \t* https://tech.badoo.com/presentation/61/",
      "post": "System engineer",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1454584596.jpg",
      "company_id": "962",
      "link_facebook": "https://www.facebook.com/anton.turetsky",
      "link_moikrug": "",
      "link_twitter": "https://twitter.com/#!/tyrchenok",
      "link_linkedin": "http://www.linkedin.com/pub/anton-turetsky/40/362/51b",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "5407",
      "title": "Илья Кудинов",
      "description": "Я тружусь в сфере QA уже больше 3-х лет, из них полтора года - в компании Badoo, где занимаюсь тестированием биллинговых систем, разработкой и оптимизацией систем автоматического тестирования. Работал QA-инженером в разных компаниях с разной организацией разработки и тестирования, потому имею достаточное количество и положительного и отрицательного опыта.  \n\n Выступал на крупнейших IT- конференциях РИТ, SQA, DevConf с профильными докладами, писал статьи на Хабр. Очень заинтересован в поднятии качества отечественного QA (и повышении престижа профессии QA-инженера) и храню это как одну из моих главных целей в карьере.",
      "post": "Sr. QA engineer",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1391789976.jpg",
      "company_id": "962",
      "link_facebook": "http://fb.com/relzeg",
      "link_moikrug": "",
      "link_twitter": "",
      "link_linkedin": "",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "7280",
      "title": "Роман Янке",
      "description": "Занимаюсь фронтенд-разработкой более 5 лет, в последнее время сосредоточился на мобильных платформах. Сейчас работаю в команде разработки мобильного приложения на iOS. У меня тут стек веб-технологий для отображения данных в приложении в веб-вьюхе.",
      "post": "Разработчик интерфейсов",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1455012172.jpg",
      "company_id": "72",
      "link_facebook": "",
      "link_moikrug": "",
      "link_twitter": "https://twitter.com/#!/romanyanke",
      "link_linkedin": "",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "8486",
      "title": "Антон Галицын",
      "description": "Занимался web-разработкой, потом разработкой автоматизации хостинга в Parallels и сейчас работаю в отделе Infrastructure & Operations в 2ГИС",
      "post": "Разработчик",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1455347821.jpg",
      "company_id": "72",
      "link_facebook": "",
      "link_moikrug": "",
      "link_twitter": "",
      "link_linkedin": "",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "8947",
      "title": "Константин Осипов",
      "description": "В Mail.Ru с 2010 года, руковожу разработкой NoSQL СУБД Tarantool. \n\nДо Mail.Ru работал в MySQL AB/Oracle, участвовал в разработке MySQL 4.1, 5.0, 5.1, 5.5. \n\nАктивный участник Moscow MySQL User Group. \n\nБлог: kostja-osipov.livejournal.com.",
      "post": "Программист",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1455350941.jpg",
      "company_id": "2142",
      "link_facebook": "",
      "link_moikrug": "",
      "link_twitter": "",
      "link_linkedin": "",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "9786",
      "title": "Анатолий Шарифулин",
      "description": "Анатолий с 2009 года занимается разработкой и развитием мобильных приложений, работал техническим директором в Точка Кипения и руководителем мобильных продуктов в Ostrovok.ru. В 2013 году Анатолий принимал участие в хакатоне AngelHack Moscow и одержал в нем победу, разработав приложение Alerter. Сейчас специализируется на ASO-оптимизации приложений в App Store и Google Play и занимается собственным стартапом AppFollow — аналитикой приложений конкурентов.",
      "post": "Основатель и руководитель",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1424696271.jpg",
      "company_id": "3507",
      "link_facebook": "http://facebook.com/sharifulin",
      "link_moikrug": "http://sharifulin.moikrug.ru/",
      "link_twitter": "http://twitter.com/sharifulin",
      "link_linkedin": "http://www.linkedin.com/in/sharifulin",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "9908",
      "title": "Никита Арыков",
      "description": "Выпускник факультета информационных технологий Новосибирского Государственного Университета.\nC 2014 года занимаюсь разработкой highload проекта по рассылке push-уведомлений - Pushwoosh.",
      "post": "Security Architect",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1457540150.jpg",
      "company_id": "4126",
      "link_facebook": "",
      "link_moikrug": "",
      "link_twitter": "",
      "link_linkedin": "http://linkedin.com/in/narykov",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "10225",
      "title": "Алексей Федоров",
      "description": "Технический евангелист в компании Одноклассники. Лидер российской Java User Group, организатор крупнейших в России конференций по Java (JPoint, Joker) и .NET (DotNext). Три года проработал в Oracle в Java Platform Group",
      "post": "Технический Евангелист",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1455349987.jpg",
      "company_id": "2975",
      "link_facebook": "http://facebook.com/23derevo",
      "link_moikrug": "",
      "link_twitter": "https://twitter.com/#!/23derevo",
      "link_linkedin": "http://linkedin.com/in/23derevo",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "10442",
      "title": "Кирилл Фёдоров",
      "description": "Работал дизайнером в Bookmate, участвовал в жизни других, менее значимых и интересных продуктов. После того как провел месяц в Кампусе Димы Барбанеля начал по-дугому относиться к профессии и мыслить иначе",
      "post": "Дизайнер",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1455419325.jpg",
      "company_id": "1537",
      "link_facebook": "https://www.facebook.com/mylostfm",
      "link_moikrug": "",
      "link_twitter": "",
      "link_linkedin": "",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "10479",
      "title": "Вячеслав Бахмутов",
      "description": "Меня зовут Слава. Я работал в яндексе в команде кокаина, был одним из организаторов первой (и единственной) команды, которая разрабатывала на Go в Яндексе. Участовал в разных конференциях яндекса (субботники, новосибирский с++ party и YaC) где рассказывал про Go. Последний год жил в Южной Америке в Чили, работая удалённо в яндексе и принимая участие в программе startup chile. Делал проект по безопасности, с которым участвовал в конференции BlackHat 2015 USA в Лас Вегасе. Сейчас работаю в Дропбоксе, пока в Сан-Франциско, но с ноября в Ирландии. Так же участвую в записи подкаста golangshow.com и подробно рассказывал про свой опыт в подкасте devzen http://devzen.ru/episode-0063/",
      "post": "Site reliability engineer",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1454236193.jpg",
      "company_id": "3862",
      "link_facebook": "",
      "link_moikrug": "",
      "link_twitter": "https://twitter.com/m0sth8",
      "link_linkedin": "",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "10480",
      "title": "Андрей Акиньшин",
      "description": "С недавних пор работаю в компании JetBrains, пишу прекрасную C# IDE под названием Rider. Помимо этого я увлекаюсь написанием хороших .NET-бенчмарков, молекулярной генетикой, цифровой обработкой сигналов, компьютерным зрением и много чем ещё.",
      "post": "Software Developer",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1454484352.jpg",
      "company_id": "384",
      "link_facebook": "",
      "link_moikrug": "",
      "link_twitter": "https://twitter.com/andrey_akinshin",
      "link_linkedin": "https://www.linkedin.com/in/AndreyAkinshin",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "10481",
      "title": "Дмитрий Стогов",
      "description": "Один из ведущих раработчиков PHP, лидер проекта PHPNG заложившего основу для PHP7, автор нескольких PHP расширений.",
      "post": "Principal Engineer",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1454238240.jpg",
      "company_id": "3863",
      "link_facebook": "",
      "link_moikrug": "",
      "link_twitter": "https://twitter.com/#!/@dstogov",
      "link_linkedin": "",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "10482",
      "title": "Андрей Светлов",
      "description": "Python Core Developer",
      "post": "Python Core Developer",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1454239388.jpg",
      "company_id": "3864",
      "link_facebook": "",
      "link_moikrug": "",
      "link_twitter": "http://twitter.com/#!/andrew_svetlov",
      "link_linkedin": "",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "10483",
      "title": "Андрей Ситник",
      "description": "Автор Автопрефиксера, PostCSS и easings.net. Разрабатывал Групон Россия, Рокетбанк. Сейчас создаю Амплифер. Машины должны страдать!",
      "post": "Ведущий фронтенд-разработчик",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1454239923.jpg",
      "company_id": "3865",
      "link_facebook": "",
      "link_moikrug": "",
      "link_twitter": "https://twitter.com/andrey_sitnik",
      "link_linkedin": "",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "10484",
      "title": "Maurice de Beijer",
      "description": "Maurice de Beijer is an independent software consultant and trainer specializing in HTML5, REST, JavaScript, AngularJS and ASP.NET MVC. He currently teaches ECMAScript, TypeScript, React, AngularJS, Modern Web Development and ASP.NET MVC courses. He has been awarded the yearly Microsoft Most Valuable Professional award since 2005. Maurice is also very active in the Dutch dotNed user group where he regularly organizes meetings and the dotNed-Pluralsight study group meetings.",
      "post": "Trainer/senior engineer",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1454240535.jpg",
      "company_id": "3866",
      "link_facebook": "",
      "link_moikrug": "",
      "link_twitter": "https://twitter.com/MauriceDB",
      "link_linkedin": "http://theproblemsolver.nl/",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "10485",
      "title": "Jan Jongboom",
      "description": "Jan Jongboom is working as Developer Evangelist IoT for ARM, and always on the lookout on how to connect the web with the real world. He loves doing unexpected stuff with sensors, flying drones from the browser, and breaking phones. Before ARM he was a core contributor to Firefox OS, and he wrote hundreds of patches to various open source projects. He's also a Google Developer Expert for Web technologies.",
      "post": "Developer Evangelist IoT",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1454240954.jpg",
      "company_id": "3867",
      "link_facebook": "",
      "link_moikrug": "",
      "link_twitter": "https://twitter.com/janjongboom",
      "link_linkedin": "",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "10486",
      "title": "Dan Cuellar",
      "description": "Dan Cuellar is the creator of the open source mobile automation framework Appium, and Head of Test Engineering at Shazam Entertainment in London. Previously, he headed the test organisation at Zoosk in San Francisco, and worked as a software engineer on Microsoft Outlook for Mac, and other products in the Microsoft Office suite. He is an advocate of open source technologies and technical software testing. He earned a Bachelor's degree in Computer Science, with a minor in Music Technology, from the world-renowned School of Computer Science at Carnegie Mellon University in Pittsburgh.",
      "post": "Head of Software Testing",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1454468370.jpg",
      "company_id": "3868",
      "link_facebook": "",
      "link_moikrug": "",
      "link_twitter": "https://twitter.com/thedancuellar",
      "link_linkedin": "https://uk.linkedin.com/in/dacuellar",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "10487",
      "title": "Kristian Karl",
      "description": "Kristian Karl has more than 20 years of experience in the testing business.\nWorking with testing in Telecom, Finance, Government and start-ups has given Kristian a broad experience in the field of software quality.\nTest automation is something he has been working with all along from the start, but Model-based Testing is a speciality Kristian has been working with since 2005.\nHe is founder of graphwalker.org (2005).\nKristian is a Test manager at Spotify since 2010",
      "post": "Test Manager",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1454242001.jpg",
      "company_id": "1442",
      "link_facebook": "",
      "link_moikrug": "",
      "link_twitter": "https://twitter.com/kristiankarl",
      "link_linkedin": "https://se.linkedin.com/in/kristian-karl-7b94622",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "10490",
      "title": "Karim Fanadka",
      "description": "Karim Fanadka have more than 8 years experience in software testing, The last 6 years he was involved in testing \"Software Testing Products\" at HPE Software, (Mercury before the acquisition by HPE), such as LoadRunner for performance testing.\nToday Karim is leading and managing \"DevTest\" team cross regions, this team responsible for testing StormRunner the new generation of performance testing. Karim built this team 3 years ago focusing on the most modern techniques and methodologies and building new test frameworks.\nKarim have a lot of knowledge to share about his journey in building a modern team, train Test Engineers that already integrated in the agile world delivering fast (Continues delivery).\nKarim also a blogger sharing his experience to all the interested:http://techbeacon.com/contributors/karim-fanadka",
      "post": "DevTest Manager",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1454485140.jpg",
      "company_id": "3869",
      "link_facebook": "https://www.facebook.com/karim.f.as",
      "link_moikrug": "",
      "link_twitter": "https://twitter.com/kim0z85",
      "link_linkedin": "https://il.linkedin.com/in/kareemfa",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "10491",
      "title": "Сергей Крапивенский",
      "description": "Ведущий iOS-разработчик в Rambler&Co, работаю там с августа 2014. Занимаюсь непосредственно разработкой приложений и развитием процессов разработки в команде.",
      "post": "iOS Developer",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1454582336.jpg",
      "company_id": "3871",
      "link_facebook": "",
      "link_moikrug": "",
      "link_twitter": "",
      "link_linkedin": "",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "10492",
      "title": "Marius Rackwitz",
      "description": "Marius has been developing mobile & web applications ever since he graduated from university. In more recent years, he's shifted his focus towards mobile development, especially iOS and Objective-C, and now a much larger portion of Swift. With his work on the CocoaPods team, he hasn't forgotten about Ruby either. Since he joined Realm, he has also become more involved in the mobile community, presenting at many conferences.",
      "post": "iOS Developer",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1454582780.jpg",
      "company_id": "3872",
      "link_facebook": "",
      "link_moikrug": "",
      "link_twitter": "https://twitter.com/mrackwitz",
      "link_linkedin": "",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "10493",
      "title": "Michael Widenius",
      "description": "Creator of MySQL and MariaDB\nFounder of MySQL Ab and MariadB Corporation Ab\nFounder of Open Ocean Capital (Investment company)",
      "post": "Founder",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1454583516.jpg",
      "company_id": "3873",
      "link_facebook": "https://www.facebook.com/michael.widenius",
      "link_moikrug": "",
      "link_twitter": "",
      "link_linkedin": "https://www.linkedin.com/in/montywi",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "10494",
      "title": "Orta Therox",
      "description": "Orta works at Artsy, where he helped create a culture in the mobile team where you need to push to distribute something privately, instead of the other way around. In doing so, we made it easier to hire, to build, to document and to share ideas. \n\nOrta is the head of mobile at Artsy, where he works on making art as accessible as music. He's a core contributor to CocoaPods, the Cocoa Dependency Manager used by hundreds of thousands of iOS projects. He's shipped apps, websites and communities.",
      "post": "Head of Mobile",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1454584151.jpg",
      "company_id": "3874",
      "link_facebook": "",
      "link_moikrug": "",
      "link_twitter": "https://twitter.com/orta",
      "link_linkedin": "",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "10495",
      "title": "Thomas Lobinger",
      "description": "Thomas Lobinger works for Amazon Web Services in Berlin. He joined Amazon after selling the startup he co-founded to Amazon in 2012. This startup became one of the Amazon Web Services and is now known as AWS OpsWorks. \n\nThomas changed roles early 2015. He is now responsible to drive innovation and automation in the world of frontend development inside the company. He has a small, super smart team in Seattle and Berlin to help him with it.",
      "post": "Technical Program Manager",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1455011253.jpg",
      "company_id": "3876",
      "link_facebook": "",
      "link_moikrug": "",
      "link_twitter": "",
      "link_linkedin": "",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "10497",
      "title": "Андрей Себрант",
      "description": "Когда-то физик, с 1995 года — в интернет-маркетинге, последние 11 лет — в Яндексе.",
      "post": "Директор по маркетингу сервисов",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1455077858.jpg",
      "company_id": "149",
      "link_facebook": "https://www.facebook.com/asebrant",
      "link_moikrug": "",
      "link_twitter": "https://twitter.com/asebrant",
      "link_linkedin": "",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "10499",
      "title": "Ignacy Kowalczyk",
      "description": "Ignacy has been working at Google for over 8 years, first as a tech lead of software engineering teams working on distributes SQL query engines for big data. Last 2 years he has been managing engineering teams working on Google Compute Engine focusing on automations enabling easy deployments and scaling user workloads on GCE. He is also interested in bioinformatics and enjoys mountaineering and rock climbing.",
      "post": "Developer Manager",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1455103008.jpg",
      "company_id": "700",
      "link_facebook": "",
      "link_moikrug": "",
      "link_twitter": "",
      "link_linkedin": "",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "10501",
      "title": "Михаил Ройзнер",
      "description": "Кандидат физико-математических наук. Закончил механико-математический факультет МГУ в 2010 году. Закончил Школу анализа данных Яндекса в 2009 году, после чего вёл в ней семинары по курсу машинному обучению и устраивал научный семинар по машинному обучению и информационному поиску. Работает в Яндексе с 2008 года. С 2012 года занимается рекомендательными системами. Руководил группой разработки рекомендательных систем. Один из изобретателей рекомендательной технологии Диско, которая используется в сервисах Яндекса: Музыка, Маркет и Дзен. Сейчас работает в отделе качества рекламы.",
      "post": "Ведущий разработчик",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1455350469.jpg",
      "company_id": "149",
      "link_facebook": "https://www.facebook.com/mroizner",
      "link_moikrug": "",
      "link_twitter": "https://twitter.com/MRoizner",
      "link_linkedin": "https://www.linkedin.com/in/mroizner",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "10502",
      "title": "Александр Золотарёв",
      "description": "Еще с университета начал увлекаться С++ и на пятом курсе собрал команду для работы над мульти-мессенджером (ICQ + AIM + IRC + MSN + Yahoo). После этого несколько лет работал в Credo-Dialogue над софтом для проектирования дорог по ГОСТам стран СНГ, где и познакомился со своими будущими кофаундерами Юрием Мельничком и Виктором Говако. Затем еще несколько лет работы в аутсорсинговых беларуских компаниях, но уже в сфере мобильных технологий (проекты под Windows Mobile и Symbian). \n\nВ конце 2009, после путешествия на Кубу с ноутбуком и внешним GPS, примерно показывающим позицию на скане бумажной карты, стало понятно, что путешественникам не хватает хороших мобильных карт, которые работали бы даже в странах без интернета. Поэтому когда в 2010 Юрий предложил всем вместе запилить офлайновые карты, никаких сомнений не возникло.",
      "post": "Сооснователь проекта MAPS.ME",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1455352324.jpg",
      "company_id": "2142",
      "link_facebook": "https://www.facebook.com/zet.alex.zet",
      "link_moikrug": "",
      "link_twitter": "",
      "link_linkedin": "https://www.linkedin.com/in/alexzolotarev",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "10503",
      "title": "Денис Запорожан",
      "description": "\t* Выпускник авторского курса иллюстрации Виктора Меламеда в Британской высшей школе дизайна.\n \t* Выпускник проекта Campus Димтрия Барбанеля.\n \t* С 2014 года — дизайнер студии инфографики в МИА РОССИЯ СЕГОДНЯ",
      "post": "Дизайнер",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1455418445.jpg",
      "company_id": "3884",
      "link_facebook": "https://www.facebook.com/denis.zaporozhan",
      "link_moikrug": "",
      "link_twitter": "",
      "link_linkedin": "",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "10504",
      "title": "Евгений Брянцев",
      "description": "Навигация для города, остановки для города, штуки для OneTwoTrip, обложка для Forbes, работаю в Яндексе.",
      "post": "Дизайнер",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1455418910.jpg",
      "company_id": "4079",
      "link_facebook": "https://www.facebook.com/likefinn",
      "link_moikrug": "",
      "link_twitter": "",
      "link_linkedin": "",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "10505",
      "title": "Денис Башев",
      "description": "Дизайнер График — Арт-директор. Опыт Работы 16 лет. \n\nСпециализация: \n\n \t* Визуальные Коммуникации\n \t* Фирменные стили\n \t* Логотипы\n\nУчеба, повышение квалификации: \n\n \t* Институт Повышения Квалификации/дизайн Интерьеров (томск)\n \t* Томский Институт Бизнеса/графический Дизайн (томск)\n \t* Британская Высшая Школа Дизайна /летний Интенсив (москва)\n \t* Высшая Академическая Школа Графического Дизайна / Бархатная Школа Каллиграфии (севастополь)\n \t* Британская Высшая Школа Дизайна /визуальные Коммуникации (москва)\n \t* Central Saint Martins College Of Art And Design /graphic Design (london)\n\nРабота: \n\n \t* Shandesign (http://shandesign.ru/)\n \t* Frontdesign (http://frontdesign.ru/)\n \t* Province (http://provincestudio.ru/)\n \t* Logvindesign Http://logvindesign.ru/)\n \t* Tomatdesign http://tomatdesign.ru/)\n \t* Sila Sveta (http://silasveta.com/)\n\nДипломы: \n\n \t* Дни Рекламы В Томске 2001 (Томск) — Серебро\n \t* Идея 2004 (Сочи) — Серебро, три бронзы\n \t* Кмфр 2004 (Киев) — Золото и бронза\n \t* Идея 2005 (Новосибирск) — Бронза\n \t* Идея 2006 (Новосибирск) — Серебро\n \t* Дни Рекламы В Томске 2006 (Томск) — Три бронзы\n \t* Дизайн и Реклама 2008 (Москва) — Серебро\n \t* Кмфр 2009 (Киев) — Бронза\n \t* Red Apple 2011 (Москва) — Серебро\n \t* Eurobest 2011 (Lisbon) — Бронза\n \t* Белый Квадрат 2012 (Минск) — Три золота и бронза\n \t* Adcr 2012 (Москва) — Золото, два серебра и бронза\n \t* Идея 2012 (Новосибирск) — Два золота, серебро и бронза\n \t* Golden Hummer 2012 (Riga) — Серебро\n \t* Adce 2012 (Barcelona) — Золото\n \t* Cannes Lions 2012 (Cannes) — Шорт-лист\n \t* Red Apple 2012 (Москва) — Два золота\n \t* Popok 2012 (Ереван) — Золото, два серебра и бронза\n \t* Epica Awards 2012 (Paris) — Серебро",
      "post": "Дизайнер",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1455466664.jpg",
      "company_id": "150",
      "link_facebook": "https://www.facebook.com/didierbashev",
      "link_moikrug": "",
      "link_twitter": "",
      "link_linkedin": "",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "10506",
      "title": "Иван Величко",
      "description": "",
      "post": "Арт-директор",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1455420475.jpg",
      "company_id": "3886",
      "link_facebook": "",
      "link_moikrug": "",
      "link_twitter": "",
      "link_linkedin": "",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "10554",
      "title": "Евгений Гусев",
      "description": "Долгое время занимался .Net, Microsoft stack. Работал в Quest Software, после этого в Dell, где начал заниматься фронтендом. Прошёл путь от CoffeeScript + Angular 1.0 до Dart + Polymer. Сейчас работаю во Wrike (www.wrike.com), высоконагруженном SAAS приложении с очень богатым клиентким кодом. Мы пишем на Dart и Polymer и стремимся быть up to date со всеми современными течениями в мире Web.",
      "post": "Frontend Teamlead",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1455593570.jpg",
      "company_id": "3912",
      "link_facebook": "",
      "link_moikrug": "",
      "link_twitter": "https://twitter.com/bunopus",
      "link_linkedin": "",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "10555",
      "title": "Антон Шаяхов",
      "description": "Знаю и люблю: \n\n \t* маркетинг в любых его проявлениях\n \t* командообразование\n \t* создание продуктов с нуля\n \t* построение качественного сервиса и сервис-дизайн\n \t* управление проектами, agile, холакратия, lean startup\n\nПроработал 5 лет в крупной уральской ИТ-компании \"СКБ Контур\", где занимался выводом новых проектов на рынок и реализацией малобюджетных проектов в сфере скрытого маркетинга, вирусной активности и PR в Интернете. С 2007 по 2012 год.\nЗатем начал работать в проекте Aviasales.ru в качестве руководителя направления онлайн-маркетинга. Отвечал за e-mail-маркетинг и маркетинг мобильных приложений по поиску дешевых авиабилетов — Aviasales и JetRadar. Выводил мобильные приложения в топ App Store и Google Play в России. Очень много знаю про мобильный маркетинг. С 2012 по 2014 год.\nЛетом 2014 года присоединился к команде Кнопки. Занимается развитием партнерских отношений, маркетингом, сервис-дизайном.",
      "post": "Биздев",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1455627515.jpg",
      "company_id": "3913",
      "link_facebook": "https://www.facebook.com/anton.shayakhov",
      "link_moikrug": "",
      "link_twitter": "",
      "link_linkedin": "",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "10598",
      "title": "Тимур Шевляков",
      "description": "Привет! Меня зовут Тимур. По образованию я - математик, по профессии - программист, а в душе - сибиряк.\nС 2009 года в течение 3 лет занимался разработкой системы рассылки электронных писем для The New York Times и различных веб приложений. В 2012 году переехал в Австрию и уже четвертый год работаю в компании Borland (A Micro Focus Company) на проекте Silk Performer - инструмент для автоматизированного нагрузочного тестирования широкого спектра приложений.\nТаким образом, по иронии судьбы продукт моей текущей профессиональной деятельности должен оценивать и верифицировать приложения, которые я разрабатывал несколько лет назад. Это очень интересный опыт, которым я готов поделиться",
      "post": "Senior R&D Engineer",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1455699837.jpg",
      "company_id": "3930",
      "link_facebook": "",
      "link_moikrug": "",
      "link_twitter": "https://twitter.com/cracketus",
      "link_linkedin": "https://www.linkedin.com/in/timur-shevlyakov-81167b60",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "10630",
      "title": "Алексей Ильичев",
      "description": "Родился в 1985 году. В 2007 окончил факультет вычислительной математики и кибернетики.\nС 2004 года в разработке программного обеспечения. \n\nНачинал с разработки шахматных алгоритмов. В 2007 году переквалифицировался в веб-разработчика и начал работать над созданием социальной сети для организации досуга. В 2008 году пришёл работать в качестве серверного разработчика в компанию Нивал Онлайн, в проект \"Аллоды Онлайн\". В 2009м году присоединился к команде AForex, где получил опыт руководства проектом и управления разработкой. В 2010 году присоединился к стартапу Qik, который был вскоре куплен компанией Skype. \n\nВ компании Skype стал заниматься внедрением гибких практик разработки. В 2012 году покинул компанию, и присоединился к ScrumTrek. В рамках работы в ScrumTrek занимается внедрением гибких процессов разработки в различных компаниях. Внедряю Agile в компаниях совершенно разного плана: от маленьких стартапов до крупных банков, от софтверных до ритейла.",
      "post": "Agile Coach",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1455628543.jpg",
      "company_id": "379",
      "link_facebook": "",
      "link_moikrug": "",
      "link_twitter": "",
      "link_linkedin": "",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "10654",
      "title": "Денис Паясь",
      "description": "Занимаюсь разработкой всяких крутых штук для страницы результатов поисковой выдачи. Работаю в Яндексе уже 4 года. \n\nАктивно писал статьи на Хабр, также написал одну из статей в корпоративном блоге. \n\nУчаствовал в разработке нескольких крупных проектов (например \"Острова\" Яндекса, и несколкьих внутренних, в том числе и проекта \"Конструктор\") \n\nНесколько лет занимаюсь менторством в рамках Школы разработки интерфейсов. За это время воспитал нескольких стажеров. \n\nВ open-source: \n\nзанимался css-comb.js:https://github.com/csscomb/csscomb.js/graphs/contributors\nесть довольно популярный (128 старов) конфиг для вима:https://github.com/L0stSoul/vim-config",
      "post": "Разработчик интерфейсов",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1455710687.jpg",
      "company_id": "149",
      "link_facebook": "",
      "link_moikrug": "",
      "link_twitter": "",
      "link_linkedin": "https://ru.linkedin.com/in/denis-payase-16963370",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "10830",
      "title": "Кирилл Харьков",
      "description": "",
      "post": "Руководитель Android разработки",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1456728327.jpg",
      "company_id": "2142",
      "link_facebook": "",
      "link_moikrug": "",
      "link_twitter": "",
      "link_linkedin": "",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "10839",
      "title": "Дмитрий Евдокимов",
      "description": "Директор исследовательского центра в компании Digital Security. Специализируется на безопасности мобильных платформ (iOS, Windows Phone). Имеет официальные благодарности от компаний SAP и Oracle за обнаруженные уязвимости. Кроме того, в область интересов входит: reverse engineering, software verification/program analysis (SMT, DBI, IR), поиск уязвимостей и написание эксплойтов, разработка программ для статического и динамического анализа кода на языке Python. Ведет рубрики в журнале \"Xakep\". Является одним из организаторов конференций DEFCON Russia (DCG #7812) и ZeroNights.",
      "post": "Директор исследовательского центра",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1456735844.jpg",
      "company_id": "3853",
      "link_facebook": "",
      "link_moikrug": "",
      "link_twitter": "https://twitter.com/evdokimovds",
      "link_linkedin": "",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "11031",
      "title": "Александр Гладких",
      "description": "Арт-директор, сооснователь Charmer",
      "post": "Арт-директор сооснователь",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1457538577.jpg",
      "company_id": "4111",
      "link_facebook": "https://www.facebook.com/alexander.gladkikh",
      "link_moikrug": "",
      "link_twitter": "",
      "link_linkedin": "",
      "link_vkontakte": "",
      "link_flamp": ""
    },
    {
      "id": "11084",
      "title": "Александр Лукин",
      "description": "Работаю в software R&D с 2010 года. Фокус экспертизы - мобильный, начинал с Android, участвовал в проектах разработки геоинформационных систем и решений для телекома. \n\nСтараюсь расширять области незнания в науке и технологиях. Исключительно рад, когда удается открыть и реализовать что-то новое на стыке инжереной экспертизы и знаний в мобильном маркетинге/аналитике/монетизации. \n\nС 2014 года работаю в Яндексе, где занимаюсь мобильными проектами. Менеджер продукта AppMetrica.",
      "post": "AppMetrica Product Manager",
      "avatar": "http://2016.codefest.ru/upload/members/logo_1457661183.jpg",
      "company_id": "149",
      "link_facebook": "https://www.facebook.com/allookin",
      "link_moikrug": "",
      "link_twitter": "",
      "link_linkedin": "https://ru.linkedin.com/in/alexander-lukin-9477b136",
      "link_vkontakte": "",
      "link_flamp": ""
    }
  ]
}